import BackToHome from "../BackToHome/BackToHome";
import './About.css';

const About = () => {
    return <div className="about-container">
        <h1>Како збиднавме?</h1>
        <img src="./Osnovaci_makstripovi.jpg" alt="founders" />
        <p>
        Во десетата година од новиот милениум, девет души се беа збрале
        да ја воздигнат деветта уметност и културата во Македонија. Различни по ќуд, но
        сплотени во нивната мисија и љубов кон стрипот се собраа и основаа братска дружина,
        дружина на македонската стрипска култура - здружението Мак Стрипови.
        Здравко Гиров, Давор Драмиќанин, Михајло Димитриевски, Игор Јовчевски, Ласко Џуровски,
        Зоран Цветковиќ, Дамјан Михаилов, Игор Кралевски и Љубиша Сулимановиќ и ден денес напорно 
        работат и не се давват во борбата за македонскиот стрип, македонската култура и вдахнување 
        креативна потпора на културно штурата денешница.
        </p>
        <BackToHome />    
    </div>
}

export default About;